cask_args appdir: "/Applications"

# 'brew tap'
tap "bramstein/webfonttools"
tap "caskroom/cask"
tap "caskroom/fonts"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# 'brew install'
brew "autoconf"
brew "automake"
brew "aws-elasticbeanstalk"
brew "readline"
brew "python"
brew "awscli"
brew "bash-git-prompt"
brew "coreutils"
brew "gnupg"
brew "libtool"
brew "libxml2"
brew "libyaml"
brew "mas"
brew "node"
brew "openssl@1.1"
brew "pkg-config"
brew "postgresql", restart_service: true
brew "redis", restart_service: true
brew "terraform"
brew "thefuck"
brew "ttfautohint"
brew "wget"
brew "woff2"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
brew "heroku/brew/heroku"

# 'brew cask install' or 'brew cask install --appdir=~/Applications'
cask "alfred"
cask "chromedriver"
cask "font-fira-code"
cask "google-chrome"
cask "firefox"
cask "spotify"

# 'mas install'
mas "1Password", id: 443987910
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
